; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	spectrograph1 - mode
	infrared2 - mode
	image3 - mode
	GroundStation3 - direction
	GroundStation11 - direction
	Star12 - direction
	Star8 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation10 - direction
	GroundStation1 - direction
	Star13 - direction
	GroundStation0 - direction
	GroundStation7 - direction
	Star6 - direction
	GroundStation9 - direction
	Star5 - direction
	Star14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 GroundStation9)
	(supports instrument2 image3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument3 image3)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star13)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation10)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation9)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Star14 infrared0)
	(have_image Phenomenon15 image3)
	(have_image Planet16 infrared0)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 4
2. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 4
3. (turn_to satellite1 phenomenon15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 4
4. (take_image satellite1 phenomenon15 instrument3 image3)
   added: (have_image phenomenon15 image3)
   goals met: 1 of 4
5. (turn_to satellite1 phenomenon17 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon17)
   goals met: 1 of 4
6. (take_image satellite1 phenomenon17 instrument3 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 2 of 4
7. (turn_to satellite1 planet16 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 planet16)
   goals met: 2 of 4
8. (take_image satellite1 planet16 instrument3 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 3 of 4
9. (turn_to satellite1 star14 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star14)
   goals met: 3 of 4
10. (take_image satellite1 star14 instrument3 infrared0)
   added: (have_image star14 infrared0)
   goals met: 4 of 4
